Revit 2027 API
PaperSizeSet.Insert Method
Insert the specified item into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	PaperSize item
)
Public Overridable Function Insert (
	item As PaperSize
) As Boolean
public:
virtual bool Insert(
	PaperSize^ item
)
abstract Insert :
        item : PaperSize -> bool
override Insert :
        item : PaperSize -> bool
Parameters
item PaperSize
The item to be inserted into the set.
Return Value
Boolean
Returns whether the item was inserted into the set.
See Also
Reference
PaperSizeSet Class
Autodesk.Revit.DB Namespace